Repository: jgoclawski/me2-tlk-tool
Catalog: src/Mass Effect 2 TLK Tool/Properties/Resources.*.resx
Languages: pl_pl

# AboutDecodingTlk
source: Decoding TLK format:
pl_pl: Dekodowanie formatu TLK:

# AboutMiscUtil
source: This product includes software developed by Jon Skeet and Marc Gravell. Contact skeet@pobox.com, or see http://www.pobox.com/~skeet/.
pl_pl: Ta aplikacja korzysta z bilbioteki, której autorami są Jon Skeet i Marc Gravell. Kontakt: skeet@pobox.com lub na stronie http://www.pobox.com/~skeet/.

# AboutRest
source: Writing to TLK, user interface:
pl_pl: Zapis do TLK, interfejs graficzny:

# AboutTitle
source: About Mass Effect 2 TLK Tool
pl_pl: Mass Effect 2 TLK Tool - informacje

# AlertExceptionGeneric
source: Error encountered. Please report it to the author (Gocek on social.bioware.com)!
pl_pl: Wystąpił błąd. Zgłoś go autorowi (Gocek na social.bioware.com)!

# AlertExceptionGenericDescription
source: Error description:
pl_pl: Opis błędu:

# AlertExceptionTlkFormat
source: Error reading TLK file! Please make sure you have chosen a file in a TLK format for Mass Effect 2 game.
pl_pl: Bład czytania pliku TLK! Upewnij się, że wybrano plik w formacie TLK dla gry Mass Effect 2.

# AlertExceptionTlkNotFound
source: Selected TLK file was not found or is corrupted.
pl_pl: Wybrano nieistniejący lub błędny plik TLK.

# AlertExceptionWrongPlatformPC
source: Error reading TLK file! It appears that you are trying to read TLK file designed for Xbox360, but you have set otherwise in Settings!
pl_pl: Bład czytania pliku TLK! Wygląda na to, że próbujesz wczytać plik TLK przeznaczony dla konsoli Xbox360, ale w Ustawieniach zaznaczono format dla komputera PC.

# AlertExceptionWrongPlatformXbox360
source: Error reading TLK file! It appears that you are trying to read TLK file designed for PC, but you have set otherwise in Settings!
pl_pl: Bład czytania pliku TLK! Wygląda na to, że próbujesz wczytać plik TLK przeznaczony dla komputera PC, ale w Ustawieniach zaznaczono format dla konsoli Xbox360.

# AlertExceptionXmlNotFound
source: Selected XML file was not found or is corrupted.
pl_pl: Wybrano nieistniejący lub błędny plik XML.

# AlertPre103XML
source: You are trying to read an XML file, which was created in an earlier version of this program! To make it fully compatible with current version, follow instructions in this thread: http://social.bioware.com/project/3492/discussion/2571/ !
pl_pl: Wczytujesz plik XML, który został utworzony w starszej wersji programu! Aby go dostosować do aktualnie używanej wersji, przeczytaj wpis stąd: http://social.bioware.com/project/3492/discussion/2571/ !

# AlertTlkLoadingFinished
source: Finished reading TLK file.
pl_pl: Czytanie pliku TLK zakończone.

# AlertWritingTlkFinished
source: Finished creating TLK file.
pl_pl: Tworzenie pliku TLK zakończone.

# ChangeButton
source: Change...
pl_pl: Zmień...

# CheckboxDebugTlk
source: Test version (displays String ID before every line in-game)
pl_pl: Wersja do testów (wyświetla String ID przed każdą linią tekstu w grze)

# CurrentInputTlkFilePath
source: Current path to TLK file:
pl_pl: Aktualna ścieżka do pliku TLK:

# CurrentInputXmlFilePath
source: Current path to XML file:
pl_pl: Aktualna ścieżka do pliku XML::

# CurrentOutputTextFile
source: Current path to output text file:
pl_pl: Aktualna ścieżka do wyjściowego pliku tekstowego:

# CurrentOutputTlkFilePath
source: Current path to output TLK file:
pl_pl: Aktualna ścieżka do wyjściowego pliku TLK:

source: Done!
pl_pl: Gotowe!

source: Error
pl_pl: Błąd

# HowTo11
source: Select 'Load TLK' tab.
pl_pl: Wybierz zakładkę 'Wczytaj plik TLK'.

# HowTo12
source: Make sure 'Current path to TLK file' points to a TLK file you wish to read from. If it doesn't - use the 'Change' button below it to select your file.
pl_pl: 'Aktualna ścieżka do pliku TLK' powinna wskazywać na plik, który ma być odczytany. Mozna ją zmienić klikając na przycisk 'Zmień...'.

# HowTo13
source: Repeat step two for 'Current path to output text file'. It should point to an XML file you would like to store your text in.
pl_pl: 'Aktualna ścieżka do wyjściowego pliku XML' powinna wskazywać na nowy plik, do którego ma być zapisany odczytany tekst.

# HowTo14
source: Hit 'Start!' and wait.
pl_pl: Naciśnij 'Start!' i poczekaj.

# HowTo15
source: You will see a message saying the work is done and all the data from the TLK file is now in a text file selected before.
pl_pl: Po chwili pojawi się okienko, mówiące że praca skończona. Wybrany plik XML zawiera teraz odczytane teksty z pliku TLK.

# HowTo21
source: Select 'Create TLK' tab.
pl_pl: Wybierz zakładkę 'Stwórz plik TLK'.

# HowTo22
source: 'Current path to XML file' should point to the previously created XML file (modified or not). If it doesn't - use the 'Change' button below it to select your file.
pl_pl: 'Aktualna ścieżka do pliku XML' powinna wskazywać na utworzony wcześniej plik XML (zmodyfikowany lub nie).

# HowTo23
source: 'Current path to output TLK file' should point to a new TLK file which will be generated from selected XML file.
pl_pl: 'Aktualna ścieżka do wyjściowego pliku TLK' powinna wskazywać na nowy plik TLK, który ma zostać utworzony.

# HowTo24
source: Hit 'Start!' and wait.
pl_pl: Naciśnij 'Start!' i poczekaj.

# HowTo25
source: You will see a message saying the work is done. Your custom TLK file is ready to be put in an appropriate Mass Effect 2 folder.
pl_pl: Po ukończeniu pracy, nowo-utworzony plik TLK jest przygotowany do wrzucenia go do odpowiedniego folderu gry Mass Effect 2.

# HowToHeader
source: Typical usage scenario
pl_pl: Podstawowe kroki

# HowToSubheader1
source: Getting text from TLK file
pl_pl: Wyciąganie tekstu z pliku TLK

# HowToSubheader2
source: Creating a new TLK file
pl_pl: Tworzenie nowego pliku TLK

# HowToTitle
source: How to use?
pl_pl: Jak używać?

# LoadTlkTab
source: Load TLK file
pl_pl: Wczytaj plik TLK

# MenuAbout
source: About
pl_pl: Informacje

# MenuExit
source: Exit
pl_pl: Zakończ

# MenuFile
source: File
pl_pl: Plik

# MenuHelp
source: Help
pl_pl: Pomoc

# MenuSettings
source: Settings
pl_pl: Ustawienia

# MenuSettingsPC
source: PC TLK file format
pl_pl: Format TLK dla komputera PC

# MenuSettingsXbox360
source: Xbox360 TLK file format
pl_pl: Format TLK dla konsoli Xbox360

# TextFilesFilter
source: XML Files (*.xml)|*.xml
pl_pl: Pliki XML (*.xml)|*.xml

# TlkFilesFilter
source: TLK Files (*.tlk)|*.tlk
pl_pl: Pliki TLK (*.tlk)|*.tlk

source: Warning!
pl_pl: Uwaga!

# WriteTlkTab
source: Create TLK file
pl_pl: Stwórz plik TLK

# XmlFilesFilter
source: XML Files (*.xml)|*.xml
pl_pl: Pliki XML (*.xml)|*.xml
